In [18]:
import pandas as pd
import numpy as np

In [19]:
data ={
    'kohli':[1,2,3,4],
    'dhoni':[5,6,7,8]
}
data

{'kohli': [1, 2, 3, 4], 'dhoni': [5, 6, 7, 8]}

In [20]:
df=pd.DataFrame(data)
df

   kohli  dhoni
0      1      5
1      2      6
2      3      7
3      4      8

In [21]:
data = {
    'a' :[11,12,13,14],
    'b' :[55,66,77,88]
}
ans=pd.DataFrame(data,index=['one','two','three','four'])
ans

        a   b
one    11  55
two    12  66
three  13  77
four   14  88

In [22]:
ans.tail(2)

        a   b
three  13  77
four   14  88

In [23]:
ans.head(2)

      a   b
one  11  55
two  12  66

In [ ]:
##Ex:1 Exercise 1: Write a Pandas program to create and display a DataFrame from a specified dictionary 
##data which has the index labels

In [24]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

exam_data

{'name': ['Anastasia',
  'Dima',
  'Katherine',
  'James',
  'Emily',
  'Michael',
  'Matthew',
  'Laura',
  'Kevin',
  'Jonas'],
 'score': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [25]:
df=pd.DataFrame(exam_data,index=['a','b','c','d','e','f','g','h','i','j'])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [11]:
##Exercise 2: Write a Pandas program to select the rows where number of attempts in the 
##examination is less than 2 and score greater than 15

In [26]:
df.loc['d','attempts']

3

In [27]:
df.loc['f','name']

'Michael'

In [28]:
print(df[(df['attempts']<2)&(df['score']>15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [13]:
##Exerise 3: Change the value in row 'd' to 11.5
##Use Data from previous questions

In [29]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [30]:
df.loc['d','score']=11.5

In [31]:
df.loc['d','score']

11.5

In [ ]:
##Exercise 4: Write a Pandas program to calculate the sum of the examination attempts by the students.

In [33]:
df['attempts'].sum()

19

In [ ]:
##Exercise 5: Drop a list of rows from a specified DataFrame
##data:
##d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [34]:
d = {
    'col1': [1, 4, 3, 4, 5], 
    'col2': [4, 5, 6, 7, 8], 
    'col3': [7, 8, 9, 0, 1]
}
d

{'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [103]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [35]:
d = {
    'col1': [1, 4, 3, 4, 5], 
    'col2': [4, 5, 6, 7, 8], 
    'col3': [7, 8, 9, 0, 1]
}
ans=pd.DataFrame(d)
ans

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [36]:
ans.drop(ans.index[[2,4]])

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [37]:
ans.drop(0)

   col1  col2  col3
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [125]:
ans

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [38]:
a=ans.columns
print(a)

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
##Exercise 6: Check whether a given column is present in a DataFrame or not

In [39]:
if 'col9' in ans.columns:
    print("yes")
else:
    print("no")

no

In [ ]:
##Exercise 7: Get column index from column name of a given DataFrame
##d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}

In [40]:
ans.columns.get_loc('col2')

1

In [ ]:
##Exercise 8: Write a Pandas program to select all columns, except one given column in a DataFrame.¶

In [41]:
ans.loc[:,ans.columns!='col1']

   col2  col3
0     4     7
1     5     8
2     6     9
3     7     0
4     8     1

In [ ]:
##Exercise 9: Write a Pandas program to remove last n rows of a given DataFrame.

In [46]:
ans.loc[:,['col1','col3']]
ans.loc[0:2]

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

In [ ]:
##Exercise 10: Display the movies longer than 30 minutes and shorter than 360 minutes
##Reading Excel**

In [159]:
exl=pd.read_excel(r'C:\Users\allur\Sample.xlsx')
exl
df=exl[['apples','oranges']]
df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2